Learning to use merge

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

First we create our dataframes that we'll merge.  Note that this time, we used a dictionary method in which we pass a dictionary and each key becomes a heading in the dataframe and each value becomes the column  of data.

In [2]:
dframe1 = DataFrame({'key':['x','z','y','z','x','x'], 'data_set_1':np.arange(6)})
dframe1

  key  data_set_1
0   x           0
1   z           1
2   y           2
3   z           3
4   x           4
5   x           5

In [5]:
dframe2 = DataFrame({'key':['q','y','z'],'data_set_2': [1,2,3]})
dframe2

  key  data_set_2
0   q           1
1   y           2
2   z           3

You can see that using the pandas .merge(1stDF, 2ndDF) combines like keys and gives available values with a column of each DF.

In [6]:
pd.merge(dframe1,dframe2)

  key  data_set_1  data_set_2
0   z           1           3
1   z           3           3
2   y           2           2

By passing the 'on=' part of the dot merge method, you can choose on what basis the two DFs will merge.

In [17]:
pd.merge(dframe1,dframe2, on='key',how='left')#merges based on the first dataframe's keys

  key  data_set_1  data_set_2
0   x           0         NaN
1   z           1         3.0
2   y           2         2.0
3   z           3         3.0
4   x           4         NaN
5   x           5         NaN

In [18]:
pd.merge(dframe1,dframe2, on='key',how='right')

  key  data_set_1  data_set_2
0   z         1.0           3
1   z         3.0           3
2   y         2.0           2
3   q         NaN           1

In [19]:
pd.merge(dframe1,dframe2, on='key',how='outer')#using outer in how gives the union of both keys

  key  data_set_1  data_set_2
0   x         0.0         NaN
1   x         4.0         NaN
2   x         5.0         NaN
3   z         1.0         3.0
4   z         3.0         3.0
5   y         2.0         2.0
6   q         NaN         1.0

Here is how to do a many to many merge

In [21]:
dframe3 = DataFrame({'key':['x','x','x','y','z','z'],'data_set_3':range(6)})

In [22]:
dframe4 = DataFrame({'key':['y','y','x','x','z'],'data_set_4':range(5)})

In [23]:
dframe3

  key  data_set_3
0   x           0
1   x           1
2   x           2
3   y           3
4   z           4
5   z           5

In [24]:
dframe4

  key  data_set_4
0   y           0
1   y           1
2   x           2
3   x           3
4   z           4

In [25]:
pd.merge(dframe3,dframe4)

  key  data_set_3  data_set_4
0   x           0           2
1   x           0           3
2   x           1           2
3   x           1           3
4   x           2           2
5   x           2           3
6   y           3           0
7   y           3           1
8   z           4           4
9   z           5           4

Merge on index instead of columns is shown below.

In [26]:
df_left = DataFrame({'key': ['X','Y','Z','X','Y'],
                  'data': range(5)})
df_right = DataFrame({'group_data': [10, 20]}, index=['X', 'Y'])

In [27]:
df_left

  key  data
0   X     0
1   Y     1
2   Z     2
3   X     3
4   Y     4

In [28]:
df_right

   group_data
X          10
Y          20

In [29]:
#Now merge, we'll use the key for the left Dframe, and the index for the right
pd.merge(df_left,df_right,left_on='key',right_index=True)

  key  data  group_data
0   X     0          10
3   X     3          10
1   Y     1          20
4   Y     4          20

In [30]:
df_left_hr = DataFrame({'key1': ['SF','SF','SF','LA','LA'],
                   'key2': [10, 20, 30, 20, 30],
                   'data_set': np.arange(5.)})
df_right_hr = DataFrame(np.arange(10).reshape((5, 2)),
                   index=[['LA','LA','SF','SF','SF'],
                          [20, 10, 10, 10, 20]],
                   columns=['col_1', 'col_2'])

In [31]:
df_left_hr

  key1  key2  data_set
0   SF    10       0.0
1   SF    20       1.0
2   SF    30       2.0
3   LA    20       3.0
4   LA    30       4.0

In [32]:
df_right_hr

       col_1  col_2
LA 20      0      1
   10      2      3
SF 10      4      5
   10      6      7
   20      8      9

In [33]:
# Now we can merge the left by using keys and the right by its index
pd.merge(df_left_hr,df_right_hr,left_on=['key1','key2'],right_index=True)

  key1  key2  data_set  col_1  col_2
0   SF    10       0.0      4      5
0   SF    10       0.0      6      7
1   SF    20       1.0      8      9
3   LA    20       3.0      0      1

In [34]:
# WE can also you .join()

# Shown on our first two DataFrames
df_left.join(df_right)

  key  data  group_data
0   X     0         NaN
1   Y     1         NaN
2   Z     2         NaN
3   X     3         NaN
4   Y     4         NaN

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
arr1 = np.arange(9).reshape((3,3))
arr1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [6]:
np.concatenate([arr1,arr1],axis=1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [7]:
np.concatenate([arr1,arr1],axis=0)

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [8]:
ser1 =  Series([0,1,2],index=['T','U','V'])

ser2 = Series([3,4],index=['X','Y'])
pd.concat([ser1,ser2])

T    0
U    1
V    2
X    3
Y    4
dtype: int64

In [9]:
pd.concat([ser1,ser2],axis=1)

     0    1
T  0.0  NaN
U  1.0  NaN
V  2.0  NaN
X  NaN  3.0
Y  NaN  4.0

In [10]:
pd.concat([ser1,ser2],axis=0)

T    0
U    1
V    2
X    3
Y    4
dtype: int64

In [11]:
pd.concat([ser1,ser2], keys=['cat1','cat2'])

cat1  T    0
      U    1
      V    2
cat2  X    3
      Y    4
dtype: int64

In [12]:
dframe1 = DataFrame(np.random.randn(4,3), columns=['X', 'Y', 'Z'])
dframe2 = DataFrame(np.random.randn(3, 3), columns=['Y', 'Q', 'X'])

In [13]:
dframe1

          X         Y         Z
0  0.393880 -0.981304 -2.071059
1 -0.524844  0.064362  0.749677
2 -0.189917 -1.000376  0.203971
3 -0.286111 -0.397251 -1.229978

In [14]:
dframe2

          Y         Q         X
0  0.192441 -1.715662 -0.191525
1  0.364491 -0.674611  1.389209
2  0.346855 -1.113897 -2.017499

In [15]:
pd.concat([dframe1,dframe2])

          X         Y         Z         Q
0  0.393880 -0.981304 -2.071059       NaN
1 -0.524844  0.064362  0.749677       NaN
2 -0.189917 -1.000376  0.203971       NaN
3 -0.286111 -0.397251 -1.229978       NaN
0 -0.191525  0.192441       NaN -1.715662
1  1.389209  0.364491       NaN -0.674611
2 -2.017499  0.346855       NaN -1.113897

In [16]:
pd.concat([dframe1,dframe2],ignore_index=True)

          X         Y         Z         Q
0  0.393880 -0.981304 -2.071059       NaN
1 -0.524844  0.064362  0.749677       NaN
2 -0.189917 -1.000376  0.203971       NaN
3 -0.286111 -0.397251 -1.229978       NaN
4 -0.191525  0.192441       NaN -1.715662
5  1.389209  0.364491       NaN -0.674611
6 -2.017499  0.346855       NaN -1.113897

combining data frames - below we creared two series and one had nulls.

In [17]:
ser1 = Series([2,np.nan,4,np.nan,6,np.nan],
           index=['Q','R','S','T','U','V'])

ser2 = Series(np.arange(len(ser1), dtype=np.float64),
           index=['Q','R','S','T','U','V'])

In [18]:
ser1

Q    2.0
R    NaN
S    4.0
T    NaN
U    6.0
V    NaN
dtype: float64

In [19]:
ser2

Q    0.0
R    1.0
S    2.0
T    3.0
U    4.0
V    5.0
dtype: float64

Here we can join the two series and use the values from series 2 where ever we have nulls in series 1 by using the np.where method followed by some logic in parenthesis.

In [23]:
Series(np.where(pd.isnull(ser1),ser2,ser1),index=ser1.index)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

Below is the easy way using .combine method

In [24]:
ser1.combine_first(ser2)

Q    2.0
R    1.0
S    4.0
T    3.0
U    6.0
V    5.0
dtype: float64

In [25]:
dframe_odds = DataFrame({'X': [1., np.nan, 3., np.nan],
                     'Y': [np.nan, 5., np.nan, 7.],
                     'Z': [np.nan, 9., np.nan, 11.]})
dframe_evens = DataFrame({'X': [2., 4., np.nan, 6., 8.],
                     'Y': [np.nan, 10., 12., 14., 16.]})

In [26]:
dframe_odds

     X    Y     Z
0  1.0  NaN   NaN
1  NaN  5.0   9.0
2  3.0  NaN   NaN
3  NaN  7.0  11.0

In [27]:
dframe_evens

     X     Y
0  2.0   NaN
1  4.0  10.0
2  NaN  12.0
3  6.0  14.0
4  8.0  16.0

In [28]:
dframe_odds.combine_first(dframe_evens)

     X     Y     Z
0  1.0   NaN   NaN
1  4.0   5.0   9.0
2  3.0  12.0   NaN
3  6.0   7.0  11.0
4  8.0  16.0   NaN

Reshaping dataframes -

In [29]:
dframe1 = DataFrame(np.arange(8).reshape((2, 4)),
                 index=pd.Index(['LA', 'SF'], name='city'),
                 columns=pd.Index(['A', 'B', 'C','D'], name='letter'))
dframe1

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

Stack can pivot the columns into the rows

In [30]:
dframe_st = dframe1.stack()
dframe_st

city  letter
LA    A         0
      B         1
      C         2
      D         3
SF    A         4
      B         5
      C         6
      D         7
dtype: int32

.unstack undoes the act

In [31]:
dframe_st.unstack()

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [32]:
dframe_st.unstack('city')

city    LA  SF
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [33]:
ser1 = Series([0, 1, 2], index=['Q', 'X', 'Y'])
ser2 = Series([4, 5, 6], index=['X', 'Y', 'Z'])

In [34]:
ser1

Q    0
X    1
Y    2
dtype: int64

In [35]:
ser2

X    4
Y    5
Z    6
dtype: int64

In [36]:
dframe = pd.concat([ser1, ser2], keys=['Alpha', 'Beta'])
dframe

Alpha  Q    0
       X    1
       Y    2
Beta   X    4
       Y    5
       Z    6
dtype: int64

In [37]:
dframe.unstack()

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [38]:
dframe.unstack().stack()

Alpha  Q    0.0
       X    1.0
       Y    2.0
Beta   X    4.0
       Y    5.0
       Z    6.0
dtype: float64

In [39]:
dframe = dframe.unstack()

In [40]:
dframe

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [41]:
dframe.stack()

Alpha  Q    0.0
       X    1.0
       Y    2.0
Beta   X    4.0
       Y    5.0
       Z    6.0
dtype: float64

In [42]:
dframe.stack(dropna=False)

Alpha  Q    0.0
       X    1.0
       Y    2.0
       Z    NaN
Beta   Q    NaN
       X    4.0
       Y    5.0
       Z    6.0
dtype: float64

Now we'll cover pivoting dataframes

In [45]:
#import pandas testing utility
import pandas.util.testing as tm; tm.N = 3

#Create a unpivoted function
def unpivot(frame):
    N, K = frame.shape
    
    data = {'value' : frame.values.ravel('F'),
            'variable' : np.asarray(frame.columns).repeat(N),
            'date' : np.tile(np.asarray(frame.index), K)}
    
    # Return the DataFrame
    return DataFrame(data, columns=['date', 'variable', 'value'])

#Set the DataFrame we'll be using
dframe = unpivot(tm.makeTimeDataFrame())

In [46]:
dframe

          date variable     value
0   2000-01-03        A  0.075500
1   2000-01-04        A  0.541296
2   2000-01-05        A -0.301822
3   2000-01-06        A  1.473337
4   2000-01-07        A  0.659925
..         ...      ...       ...
115 2000-02-07        D -0.328448
116 2000-02-08        D  0.228028
117 2000-02-09        D  0.691983
118 2000-02-10        D  0.519482
119 2000-02-11        D -0.219980

[120 rows x 3 columns]

In [47]:
dframe_piv = dframe.pivot('date','variable','value')
dframe_piv

variable           A         B         C         D
date
2000-01-03  0.075500  0.783606 -1.757870  0.364592
2000-01-04  0.541296 -0.516109  1.089251 -1.069532
2000-01-05 -0.301822  0.404322  1.031188 -0.441147
2000-01-06  1.473337  0.091835 -0.006621 -0.128384
2000-01-07  0.659925 -0.618645 -1.094284  0.822492
2000-01-10  0.775951  0.032401 -0.580646 -1.396313
2000-01-11  0.680615  1.313545  0.635551 -0.189610
2000-01-12  0.055499  1.025708  1.780363 -0.060899
2000-01-13 -1.320061 -1.240339  0.048269  0.485739
2000-01-14  0.105630 -0.841987 -1.208031 -1.057847
2000-01-17  1.330362  0.541691  0.803700 -0.533042
2000-01-18 -0.317450 -0.652479 -0.344114  1.967319
2000-01-19  0.939588 -1.112814  0.262083 -0.067145
2000-01-20 -1.061239  0.527787  0.534786 -0.315757
2000-01-21  0.486568 -1.276782 -1.051189 -0.951868
2000-01-24  0.128264  0.052516  0.412062  0.092394
2000-01-25  0.295939 -1.424686 -0.163203  0.312098
2000-01-26  2.573123 -0.699883 -1.418468  0.282858
2000-01-27  0.188587  0.282840  0.546029  0.239060
2000-01-28  0.086502 -1.016614 -0.494462 -0.550801
2000-01-31  0.536060 -1.530592 -0.616132 -0.978652
2000-02-01 -0.823845 -0.135534  1.424758  0.512361
2000-02-02  0.198781  0.417536  1.240609  0.796138
2000-02-03  2.843951 -1.473950 -1.016606  0.220170
2000-02-04  1.553583  0.147557  0.585853 -0.626552
2000-02-07  1.371742  1.058495  0.013887 -0.328448
2000-02-08  0.351714  1.821034  0.506928  0.228028
2000-02-09 -1.514069 -0.324075  0.971005  0.691983
2000-02-10 -0.026610  0.422536 -0.666586  0.519482
2000-02-11  0.544653 -0.765937 -0.238583 -0.219980

There was a testing utility that was deprecated and I had to play around to get the code in cell 45 to work.  In the end, the instructor said it wasn't necessary to know how that worked and that it was just used to create the example.

Duplicates in dataframes

In [48]:
dframe = DataFrame({'key1': ['A'] * 2 + ['B'] * 3,
                  'key2': [2, 2, 2, 3, 3]})
dframe

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [49]:
dframe.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

This could be used to find dups in rework tracker.

In [50]:
dframe.drop_duplicates()

  key1  key2
0    A     2
2    B     2
3    B     3

using drop_duplicates() removes the dups

In [51]:
dframe.drop_duplicates('key1')

  key1  key2
0    A     2
2    B     2

Placing a category in the paren would remove dups only in that column

In [55]:
dframe.drop_duplicates(['key1'],keep='last')

  key1  key2
1    A     2
4    B     3

Once again things have changed and the take_last = True argument used by the instructor no longer exists.  Instead I figured out the correct argument and syntax by using the documentation via shift tab.

mapping

In [56]:
dframe = DataFrame({'city':['Alma','Brian Head','Fox Park'],
                    'altitude':[3158,3000,2762]})
dframe

         city  altitude
0        Alma      3158
1  Brian Head      3000
2    Fox Park      2762

In [57]:
state_map={'Alma':'Colorado','Brian Head':'Utah','Fox Park':'Wyoming'}

In [58]:
state_map

{'Alma': 'Colorado', 'Brian Head': 'Utah', 'Fox Park': 'Wyoming'}

In [59]:
#to map the state_map to the dframe, do the following:
dframe['state'] = dframe['city'].map(state_map)

In [60]:
dframe

         city  altitude     state
0        Alma      3158  Colorado
1  Brian Head      3000      Utah
2    Fox Park      2762   Wyoming

To be clear, we assigned dframe by column 'city' mapped by state_map to the newly created dframe column state.
dframe['state'] = dframe['city'].map(state_map).  This is great for data cleaning

Replacing values

In [61]:
ser1 = Series([1,2,3,4,1,2,3,4])
ser1

0    1
1    2
2    3
3    4
4    1
5    2
6    3
7    4
dtype: int64

Using the .replace method is easy.  You pass through what you want to replace first and follow it with what you want to put in its place.

In [62]:
ser1.replace(1,np.nan)

0    NaN
1    2.0
2    3.0
3    4.0
4    NaN
5    2.0
6    3.0
7    4.0
dtype: float64

You can replace multiple items by using lists of them in the same way.  Be sure the values line up as if you were doing individual items.

In [63]:
ser1.replace([1,4],[100,400])

0    100
1      2
2      3
3    400
4    100
5      2
6      3
7    400
dtype: int64

You can also use a dictionary method in which the key is what is to be replaced and the value is what you replace it with

In [65]:
ser1.replace({4:np.nan})

0    1.0
1    2.0
2    3.0
3    NaN
4    1.0
5    2.0
6    3.0
7    NaN
dtype: float64

renaming indexs

In [67]:
dframe= DataFrame(np.arange(12).reshape((3, 4)),
                 index=['NY', 'LA', 'SF'],
                 columns=['A', 'B', 'C', 'D'])

In [68]:
dframe

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [71]:
dframe.index.map(str.lower)

Index(['ny', 'la', 'sf'], dtype='object')

In [73]:
dframe.index=dframe.index.map(str.lower)

In [74]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [77]:
dframe.rename(index=str.upper,columns=str.lower)

    a  b   c   d
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [80]:
dframe.rename(index={'ny':'NewYork'}, columns={'A': 'Alpha'})

         Alpha  B   C   D
NewYork      0  1   2   3
la           4  5   6   7
sf           8  9  10  11

In [81]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [83]:
dframe.rename(index={'ny':'NewYork'}, columns={'A': 'Alpha'},inplace=True)

In [84]:
dframe

         Alpha  B   C   D
NewYork      0  1   2   3
la           4  5   6   7
sf           8  9  10  11

In [69]:
dframe2 = DataFrame(np.arange(6).reshape((2,3)),index=['NY','LA'],columns=['a','b','c'])

In [70]:
dframe2

    a  b  c
NY  0  1  2
LA  3  4  5

Binning

In [85]:
years = [1990,1991,1992,2008,2012,2015,1987,1969,2013,2008,1999]

In [86]:
decade_bins = [1960,1970,1980,1990,2000,2010,2020]

In [92]:
decade_cat = pd.cut(years,decade_bins)

In [96]:
decade_cat

[(1980, 1990], (1990, 2000], (1990, 2000], (2000, 2010], (2010, 2020], ..., (1980, 1990], (1960, 1970], (2010, 2020], (2000, 2010], (1990, 2000]]
Length: 11
Categories (6, interval[int64]): [(1960, 1970] < (1970, 1980] < (1980, 1990] < (1990, 2000] < (2000, 2010] < (2010, 2020]]

In [97]:
decade_cat.categories

IntervalIndex([(1960, 1970], (1970, 1980], (1980, 1990], (1990, 2000], (2000, 2010], (2010, 2020]],
              closed='right',
              dtype='interval[int64]')

In [98]:
pd.value_counts(decade_cat)

(2010, 2020]    3
(1990, 2000]    3
(2000, 2010]    2
(1980, 1990]    2
(1960, 1970]    1
(1970, 1980]    0
dtype: int64

In [99]:
pd.cut(years,2,precision=1)

[(1969.0, 1992.0], (1969.0, 1992.0], (1969.0, 1992.0], (1992.0, 2015.0], (1992.0, 2015.0], ..., (1969.0, 1992.0], (1969.0, 1992.0], (1992.0, 2015.0], (1992.0, 2015.0], (1992.0, 2015.0]]
Length: 11
Categories (2, interval[float64]): [(1969.0, 1992.0] < (1992.0, 2015.0]]

Note the wierd notation with the open paren meaning open and the closed bracket meaning closed.  cut bins the object.

outliers

In [100]:
np.random.seed(12345)
dframe = DataFrame(np.random.randn(1000,4))

Above is a quick method to create a large dataframe

In [101]:
dframe

            0         1         2         3
0   -0.204708  0.478943 -0.519439 -0.555730
1    1.965781  1.393406  0.092908  0.281746
2    0.769023  1.246435  1.007189 -1.296221
3    0.274992  0.228913  1.352917  0.886429
4   -2.001637 -0.371843  1.669025 -0.438570
..        ...       ...       ...       ...
995  1.089085  0.251232 -1.451985  1.653126
996 -0.478509 -0.010663 -1.060881 -1.502870
997 -1.946267  1.013592  0.037333  0.133304
998 -1.293122 -0.322542 -0.782960 -0.303340
999  0.089987  0.292291  1.177706  0.882755

[1000 rows x 4 columns]

We know from our statistics studies that mean and std are drastically affected by outliers

In [102]:
dframe.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [103]:
col = dframe[0]

In [105]:
col.head()

0   -0.204708
1    1.965781
2    0.769023
3    0.274992
4   -2.001637
Name: 0, dtype: float64

using np.abs(col)>3 allows us to note outliers in that column

In [106]:
col[np.abs(col)>3]

523   -3.428254
900    3.366626
Name: 0, dtype: float64

Using the same with dframe can show us any row that has a column greater than 3 (outlier)

In [111]:
dframe[(np.abs(dframe)>3).any(1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

In order to cap the values of our data at abs3, we can do the following:
the absolute value of any value in dframe that is greater than 3 will be assigned the value of 1*3 or -1*3 depending on the original value's sign.

In [112]:
dframe[np.abs(dframe)>3]=np.sign(dframe)*3

In [114]:
dframe.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000

Permutations - reordering of a set of data

In [116]:
dframe = DataFrame(np.arange(4 * 4).reshape((4, 4)))

In [117]:
dframe

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

We created a simple 4x4 matrix.  Then we create a random permutation of 0,1,2,3

In [118]:
blender = np.random.permutation(4)

blender

array([1, 3, 0, 2])

Now we can apply the blender permutation to the entire dframe like this:

In [121]:
dframe.take(blender)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
2   8   9  10  11

The result is that the index column's rows have shifted to match the blender array.  We can also do it to the columns by passing an axis

In [122]:
dframe.take(blender, axis=1)

    1   3   0   2
0   1   3   0   2
1   5   7   4   6
2   9  11   8  10
3  13  15  12  14

The following is an example of permutation with replacement

In [123]:
box = np.array([1,2,3])

In [124]:
box

array([1, 2, 3])

In [125]:
shaker = np.random.randint(0, len(box), size=10)

In [126]:
shaker

array([0, 2, 0, 2, 0, 2, 2, 2, 0, 2])

In [127]:
hand_grabs = box.take(shaker)

In [128]:
hand_grabs

array([1, 3, 1, 3, 1, 3, 3, 3, 1, 3])